brew "actionlint"
brew "azure-cli"
brew "bash-completion"
brew "bash"
brew "bat"
brew "beads"
brew "btop"
brew "docker-completion"
brew "dust"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "fzf-tab"
brew "gallery-dl"
brew "gemini-cli"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "grype"
brew "htop"
brew "httpie"
brew "jj"
brew "ktlint"
brew "kubecolor"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "minikube"
brew "mole"
brew "neovim"
brew "nvm"
brew "octant"
brew "opencode"
brew "podman"
brew "pre-commit"
brew "procs"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "simdjson"
brew "starship"
brew "steipete/tap/summarize"
brew "swiftformat"
brew "swiftlint"
brew "tailspin"
brew "thefuck"
brew "tilt-dev/tap/tilt"
brew "tmux"
brew "tree"
brew "uv"
brew "vapor"
brew "vim"
brew "wget"
brew "xcodegen"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
cask "claude-code"
cask "codex"
cask "dotnet-sdk"
cask "flutter"
cask "ghostty"
cask "swiftformat-for-xcode"
cask "syntax-highlight"
tap "anchore/grype"
tap "dart-lang/dart"
tap "hidetatz/tap"
tap "homebrew/core"
tap "homebrew/services"
tap "instrumenta/instrumenta"
tap "steipete/tap"
tap "tilt-dev/tap"
